
&НаКлиенте
Процедура СохранитьСхемуВXML(Команда)

	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ВыборФайла.Заголовок = "Сохраненить схему комапоновки данных";
	ВыборФайла.Фильтр = "Документ XML| *.xml";
	
	ОписаниеОповещения_ = Новый ОписаниеОповещения("СохранитьСхемуВXML_Завершение", ЭтотОбъект);
	ВыборФайла.Показать(ОписаниеОповещения_);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСхемуВXML_Завершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
		ЗаписьХМД_Новый(ПутьКФайлу)
	КонецЕсли;	 
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьХМД_Новый(ПутьКФайлу)

	СхемаКомпоновки = Отчеты.ОстаткиТоваровНаСкладах.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПутьКФайлу);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СхемаКомпоновки);
	ЗаписьXML.Закрыть();
	 
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьСхемуИзXML(Команда)
	ЗагрузитьСхемуИзXMLНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхемуИзXMLНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

