 Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Если это рекурсивный вызов - ничего не делать
	Если НЕ Параметры.Свойство("Рекурсия") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		// Получить стандартный список выбора
		Параметры.Вставить("Рекурсия");
		СтандартныйСписок = ПолучитьДанныеВыбора(Параметры);
		
		// Добавить к стандартному списку собственный элемент
		ДополнительныйЭлемент = Справочники.Контрагенты.НайтиПоКоду("000000011");
		СтандартныйСписок.Добавить(ДополнительныйЭлемент);
		
		ДанныеВыбора = СтандартныйСписок;
		
	КонецЕсли;	
	
КонецПроцедуры
